ssenja/TMM737/BSP/GD32H7xx_HAL/SRC/gd32h73x_75x_mdma.c
/*!
    \brief      configure transfer burst beats of source
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sbeat: source transfer burst beats
      \arg        MDMA_SOURCE_BURST_SINGLE: single burst
      \arg        MDMA_SOURCE_BURST_2BEATS: 2-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_4BEATS: 4-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_8BEATS: 8-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_16BEATS: 16-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_32BEATS: 32-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_64BEATS: 64-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_128BEATS: 128-beat incrementing burst
    \param[out] none
    \retval     none
*/
void mdma_source_burst_beats_config(mdma_channel_enum channelx, uint32_t sbeat)
{
    /* configure transfer burst beats of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SBURST;
    MDMA_CHXCFG(channelx) |= sbeat;
}

/*!
    \brief      configure transfer burst beats of destination
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in] dbeat: destination transfer burst beats
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_BURST_SINGLE: single burst
      \arg        MDMA_DESTINATION_BURST_2BEATS: 2-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_4BEATS: 4-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_8BEATS: 8-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_16BEATS: 16-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_32BEATS: 32-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_64BEATS: 64-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_128BEATS: 128-beat incrementing burst
    \param[out] none
    \retval     none
*/
void mdma_destination_burst_beats_config(mdma_channel_enum channelx, uint32_t dbeat)
{
    /* configure transfer burst beats of destination */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DBURST;
    MDMA_CHXCFG(channelx) |= dbeat;
}

/*!
    \brief      configure data size of source
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  swidth: source data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_DATASIZE_8BIT: data size of source is 8-bit
      \arg        MDMA_SOURCE_DATASIZE_16BIT: data size of source is 16-bit
      \arg        MDMA_SOURCE_DATASIZE_32BIT: data size of source is 32-bit
      \arg        MDMA_SOURCE_DATASIZE_64BIT: data size of source is 64-bit
    \param[out] none
    \retval     none
*/
void mdma_source_width_config(mdma_channel_enum channelx, uint32_t swidth)
{
    /* configure data size of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SWIDTH;
    MDMA_CHXCFG(channelx) |= swidth;
}

/*!
    \brief      configure data size of destination
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dwidth: destination data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_DATASIZE_8BIT: data size of destination is 8-bit
      \arg        MDMA_DESTINATION_DATASIZE_16BIT: data size of destination is 16-bit
      \arg        MDMA_DESTINATION_DATASIZE_32BIT: data size of destination is 32-bit
      \arg        MDMA_DESTINATION_DATASIZE_64BIT: data size of destination is 64-bit
    \param[out] none
    \retval     none
*/
void mdma_destination_width_config(mdma_channel_enum channelx, uint32_t dwidth)
{
    /* configure data size of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DWIDTH;
    MDMA_CHXCFG(channelx) |= dwidth;
}

/*!
    \brief      configure source adress increment mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sinc: source adress increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_INCREASE_DISABLE: no increment
      \arg        MDMA_SOURCE_INCREASE_8BIT: source address is increased by 8-bit
      \arg        MDMA_SOURCE_INCREASE_16BIT: source address is increased by 16-bit
      \arg        MDMA_SOURCE_INCREASE_32BIT: source address is increased by 32-bit
      \arg        MDMA_SOURCE_INCREASE_64BIT: source address is increased by 64-bit
      \arg        MDMA_SOURCE_DECREASE_8BIT: source address is decreased by 8-bit
      \arg        MDMA_SOURCE_DECREASE_16BIT: source address is decreased by 16-bit
      \arg        MDMA_SOURCE_DECREASE_32BIT: source address is decreased by 32-bit
      \arg        MDMA_SOURCE_DECREASE_64BIT: source address is decreased by 64-bit
    \param[out] none
    \retval     none
*/
void mdma_source_increment_config(mdma_channel_enum channelx, uint32_t sinc)
{
    /* configure adress increment mode of source */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_SIMOD | MDMA_CHXCFG_SIOS);
    MDMA_CHXCFG(channelx) |= sinc;
}

/*!
    \brief      configure destination adress increment mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dinc: destination adress increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_INCREASE_DISABLE: no increment
      \arg        MDMA_DESTINATION_INCREASE_8BIT: destination address is increased by 8-bit
      \arg        MDMA_DESTINATION_INCREASE_16BIT: destination address is increased by 16-bit
      \arg        MDMA_DESTINATION_INCREASE_32BIT: destination address is increased by 32-bit
      \arg        MDMA_DESTINATION_INCREASE_64BIT: destination address is increased by 64-bit
      \arg        MDMA_DESTINATION_DECREASE_8BIT: destination address is decreased by 8-bit
      \arg        MDMA_DESTINATION_DECREASE_16BIT: destination address is decreased by 16-bit
      \arg        MDMA_DESTINATION_DECREASE_32BIT: destination address is decreased by 32-bit
      \arg        MDMA_DESTINATION_DECREASE_64BIT: destination address is decreased by 64-bit
    \param[out] none
    \retval     none
*/
void mdma_destination_increment_config(mdma_channel_enum channelx, uint32_t dinc)
{
    /* configure adress increment mode of destination */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_DIMOD | MDMA_CHXCFG_DIOS);
    MDMA_CHXCFG(channelx) |= dinc;
}

/*!
    \brief      enable MDMA channel bufferable write mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) |= MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      disable MDMA channel bufferable write mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      enable MDMA channel software request
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_software_request_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_SWREQ;
}

/*!
    \brief      enable MDMA channel
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      disable MDMA channel
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) &= ~MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      get MDMA transfer error direction
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     transfer error direction: MDMA_READ_ERROR or MDMA_WRITE_ERROR
*/
uint32_t mdma_transfer_error_direction_get(mdma_channel_enum channelx)
{
    return (MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_TERRD);
}

/*!
    \brief      get MDMA transfer error address
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     the low 7 bits of the transfer error address
*/
uint32_t mdma_transfer_error_address_get(mdma_channel_enum channelx)
{
    return (uint32_t)(MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_ERRADDR);
}

/*!
    \brief      get MDMA flag
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_FLAG_ERR: transfer error flag
      \arg        MDMA_FLAG_CHTCF: channel transfer complete flag
      \arg        MDMA_FLAG_MBTCF: multi-block transfer complete flag
      \arg        MDMA_FLAG_BTCF: block transfer complete flag
      \arg        MDMA_FLAG_TCF: buffer transfer complete flag
      \arg        MDMA_FLAG_REQAF: request active flag
      \arg        MDMA_FLAG_LDTERR: link data transfer error flag in the last transfer of the channel
      \arg        MDMA_FLAG_MDTERR: mask data error flag
      \arg        MDMA_FLAG_ASERR: address and size error flag
      \arg        MDMA_FLAG_BZERR: block size error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mdma_flag_get(mdma_channel_enum channelx, uint32_t flag)
{
    uint32_t flag_pos = 0U;
    FlagStatus ret = RESET;

