ssenja/TMM737/BSP/GD32H7xx_HAL/SRC/gd32h73x_75x_mdma.c
    if(STAT1_FLAG & flag) {
        /* get the flag in CHXSTAT1 */
        flag_pos = (flag & STAT1_FLAG_MASK);
        if(MDMA_CHXSTAT1(channelx) & flag_pos) {
            ret = SET;
        } else {
            ret = RESET;
        }
    } else {
        /* get the flag in CHXSTAT0 */
        if(MDMA_CHXSTAT0(channelx) & flag) {
            ret = SET;
        } else {
            ret = RESET;
        }
    }
    return ret;
}

/*!
    \brief      clear MDMA flag
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  flag: specify clear which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_FLAG_ERR: transfer error flag
      \arg        MDMA_FLAG_CHTCF: channel transfer complete flag
      \arg        MDMA_FLAG_MBTCF: multi-block transfer complete flag
      \arg        MDMA_FLAG_BTCF: block transfer complete flag
      \arg        MDMA_FLAG_TCF: buffer transfer complete flag
      \arg        MDMA_FLAG_LDTERR: link data transfer error flag in the last transfer of the channel
      \arg        MDMA_FLAG_MDTERR: mask data error flag
      \arg        MDMA_FLAG_ASERR: address and size error flag
      \arg        MDMA_FLAG_BZERR: block size error flag
    \param[out] none
    \retval     none
*/
void mdma_flag_clear(mdma_channel_enum channelx, uint32_t flag)
{
    if(STAT1_FLAG & flag) {
        MDMA_CHXSTATC(channelx) |= MDMA_CHXSTATC_ERRC;
    } else {
        MDMA_CHXSTATC(channelx) |= flag;
    }
}

/*!
    \brief      enable MDMA interrupt
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to enbale
                one or more parameters can be selected which are shown as below:
      \arg        MDMA_INT_ERR: transfer error interrupt
      \arg        MDMA_INT_CHTC: channel transfer complete interrupt
      \arg        MDMA_INT_MBTC: multi-block transfer complete interrupt
      \arg        MDMA_INT_BTC: block transfer complete interrupt
      \arg        MDMA_INT_TC: buffer transfer complete interrupt
    \param[out] none
    \retval     none
*/
void mdma_interrupt_enable(mdma_channel_enum channelx, uint32_t interrupt)
{
    MDMA_CHXCTL0(channelx) |= interrupt;
}

/*!
    \brief      disable MDMA interrupt
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to disbale
                one or more parameters can be selected which are shown as below:
      \arg        MDMA_INT_ERR: transfer error interrupt
      \arg        MDMA_INT_CHTC: channel transfer complete interrupt
      \arg        MDMA_INT_MBTC: multi-block transfer complete interrupt
      \arg        MDMA_INT_BTC: block transfer complete interrupt
      \arg        MDMA_INT_TC: buffer transfer complete interrupt
    \param[out] none
    \retval     none
*/
void mdma_interrupt_disable(mdma_channel_enum channelx, uint32_t interrupt)
{
    MDMA_CHXCTL0(channelx) &= ~interrupt;
}

/*!
    \brief      get MDMA interrupt flag
    \param[in]  channelx: specify which MDMA channel to get flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  int_flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_INT_FLAG_ERR: transfer error interrupt flag
      \arg        MDMA_INT_FLAG_CHTCF: channel transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_MBTCF: multi-block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_BTCF: block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_TCF: buffer transfer complete interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mdma_interrupt_flag_get(mdma_channel_enum channelx, uint32_t int_flag)
{
    uint32_t interrupt_enable = 0U, interrupt_flag = 0U;
    FlagStatus ret = RESET;

    switch(int_flag) {
    case MDMA_INT_FLAG_ERR:
        /* get error interrupt enable bit and flag bit */
        interrupt_enable = (MDMA_CHXCTL0(channelx) & MDMA_CHXCTL0_ERRIE);
        interrupt_flag = (MDMA_CHXSTAT0(channelx) & int_flag);
        break;
    case MDMA_INT_FLAG_CHTCF:
        /* get channel transfer complete interrupt enable bit and flag bit */
        interrupt_enable = (MDMA_CHXCTL0(channelx) & MDMA_CHXCTL0_CHTCIE);
        interrupt_flag = (MDMA_CHXSTAT0(channelx) & int_flag);
        break;
    case MDMA_INT_FLAG_MBTCF:
        /* get multi-block transfer complete interrupt enable bit and flag bit */
        interrupt_enable = (MDMA_CHXCTL0(channelx) & MDMA_CHXCTL0_MBTCIE);
        interrupt_flag = (MDMA_CHXSTAT0(channelx) & int_flag);
        break;
    case MDMA_INT_FLAG_BTCF:
        /* get block transfer complete interrupt enable bit and flag bit */
        interrupt_enable = (MDMA_CHXCTL0(channelx) & MDMA_CHXCTL0_BTCIE);
        interrupt_flag = (MDMA_CHXSTAT0(channelx) & int_flag);
        break;
    case MDMA_INT_FLAG_TCF:
        /* get buffer transfer complete interrupt enable bit and flag bit */
        interrupt_enable = (MDMA_CHXCTL0(channelx) & MDMA_CHXCTL0_TCIE);
        interrupt_flag = (MDMA_CHXSTAT0(channelx) & int_flag);
        break;
    default:
        break;
    }

    if(interrupt_flag && interrupt_enable) {
        ret = SET;
    } else {
        ret = RESET;
    }
    return ret;
}

/*!
    \brief      clear MDMA interrupt flag
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  int_flag: specify clear which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_INT_FLAG_ERR: transfer error interrupt flag
      \arg        MDMA_INT_FLAG_CHTCF: channel transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_MBTCF: multi-block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_BTCF: block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_TCF: buffer transfer complete interrupt flag
    \param[out] none
    \retval     none
*/
void mdma_interrupt_flag_clear(mdma_channel_enum channelx, uint32_t int_flag)
{
    MDMA_CHXSTATC(channelx) |= int_flag;
}
